{
  "backend/main.mo": "Motoko canister defining backend logic for access control, admin role management (including email-to-principal association), user profiles, and blob storage integration, with strict authorization checks enforced via traps.",
  "feature_evidence.json": "Structured report documenting implemented features related to admin routing fixes, backend-protected admin access, and email-based admin role assignment, including affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend source files describing UI components, pages, hooks, styles, and their responsibilities across the application.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the React application via the main TypeScript module.",
  "frontend/src/App.tsx": "Main React application entry with global error boundaries, theme provider, toast notifications, and full routing setup for public pages, admin panel, and control panel using TanStack Router.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin panel layout that enforces authentication and admin access, shows loading and error states, and renders a sidebar menu with admin routes and logout handling.",
  "frontend/src/components/AuthModal.tsx": "Reusable authentication modal component supporting login and signup modes with client-side validation, animated UI, and placeholder logic for future backend integration.",
  "frontend/src/components/control/ControlLayout.tsx": "Control panel layout for authenticated users with sidebar navigation, mobile support, identity checks, loading handling, and protected routed content.",
  "frontend/src/components/control/StandaloneControlLayout.tsx": "Defines the main authenticated control panel layout with sidebar navigation, mobile menu, and logout handling. Redirects unauthenticated users to the home page and shows loading or login prompts based on Internet Identity state.",
  "frontend/src/components/Footer.tsx": "Defines a site footer with about text, social media icons, and navigation links (Quick Links and Get Involved), styled with gradients and icons.",
  "frontend/src/components/Header.tsx": "Implements a responsive, animated header with logo, navigation links, scroll-based styling, and authentication controls using Internet Identity and an auth modal.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout wrapping Header, Footer, and routed content with error boundaries, suspense loading states, and safe fallbacks.",
  "frontend/src/ControlApp.tsx": "Standalone React app configuration for the control panel, defining its own router, layout, routes, theme provider, and toaster.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query-powered hook to create and manage a backend actor tied to the current Internet Identity or anonymous access. Automatically recreates the actor on identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useAdminAccess.ts": "Determines authentication and admin authorization state by querying the backend for the caller’s user role. Exposes loading, authentication, admin status, role, and error information.",
  "frontend/src/hooks/useAdminQueries.ts": "Defines admin-only React Query hooks and mutations for managing backend data such as programs, team members, events, and impact stories. Handles cache invalidation and error logging after mutations.",
  "frontend/src/hooks/useAdminRoleManagement.ts": "Provides mutations for associating emails with principals and granting admin roles via the backend actor. Invalidates admin role queries after successful updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using Dfinity AuthClient. Manages login, logout, persisted identities, and detailed login status flags for the app.",
  "frontend/src/hooks/useQueries.ts": "Exposes public-facing React Query hooks for fetching programs, team members, impact stories, events, and related data from the backend actor. Includes caching, retries, and safe fallbacks when the actor is unavailable.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines extensive CSS variables for a luminous light theme and dark mode, including color palettes, gradients, and section backgrounds. Applies global styling such as bold typography, background/foreground colors, and border defaults.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and renders the App wrapped with React Query's QueryClientProvider and a custom InternetIdentityProvider. Imports global styles from index.css.",
  "frontend/src/pages/AboutPage.tsx": "Implements the About page with mission, values, impact stories, and team sections, using cards, badges, icons, and animated scroll effects. Fetches impact stories and team members via custom query hooks and applies intersection-based animations.",
  "frontend/src/pages/admin/AdminContacts.tsx": "Admin interface for viewing, marking, and deleting contact form submissions. Shows message statistics, unread counts, and a table with actions and confirmation dialogs.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing aggregated platform statistics such as programs, events, donations, and contacts. Also includes a form to grant admin rights by email and principal ID with validation and feedback.",
  "frontend/src/pages/admin/AdminDonations.tsx": "Admin dashboard page that fetches and displays all donations, showing summary cards for total count, total amount, and average donation, plus a table listing individual donations.",
  "frontend/src/pages/admin/AdminEvents.tsx": "Admin CRUD interface for events, including listing, filtering, adding, editing, and deleting events with dialogs, image upload handling, and status management.",
  "frontend/src/pages/admin/AdminImpactStories.tsx": "Admin management page for impact stories, allowing creation, editing, publishing toggles, image uploads, and deletion with dialogs and loading states.",
  "frontend/src/pages/admin/AdminLogin.tsx": "Admin login and access request page that authenticates via Internet Identity, checks admin access, and allows users to associate an email for admin approval.",
  "frontend/src/pages/admin/AdminPrograms.tsx": "Admin CRUD page for programs, enabling creation, editing, and deletion of programs with objectives, outcomes, categories, image uploads, and confirmation dialogs.",
  "frontend/src/pages/admin/AdminTeam.tsx": "Admin page for managing team members, including listing, adding, editing, deleting, ordering, visibility toggling, and photo uploads via admin API hooks.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact page with organization contact details, social media links, and a contact form with validation and submission via a query mutation. Uses toast notifications for feedback and scroll-triggered animations for UI elements.",
  "frontend/src/pages/control/ControlDashboard.tsx": "Control panel dashboard displaying key statistics (programs, events, team members, impact stories, etc.) with clickable cards powered by admin dashboard stats.",
  "frontend/src/pages/control/ControlEvents.tsx": "CRUD management interface for events with search and status filtering, supporting date handling, image uploads, and admin API mutations.",
  "frontend/src/pages/control/ControlGallery.tsx": "Placeholder gallery management page that informs users gallery image management is coming soon and currently static.",
  "frontend/src/pages/control/ControlImpact.tsx": "Admin interface to create, edit, publish/unpublish, search, and delete impact stories with optional image uploads.",
  "frontend/src/pages/control/ControlPrograms.tsx": "Admin CRUD page for programs, allowing search, image uploads, and editing of program metadata, objectives, and outcomes.",
  "frontend/src/pages/control/ControlTeam.tsx": "Admin/control panel React page for managing team members, including listing, searching, adding, editing, deleting, and toggling visibility, with dialogs, form state, and image upload via ExternalBlob.",
  "frontend/src/pages/control/StandaloneControlDashboard.tsx": "Standalone control panel dashboard that fetches admin statistics and displays them as styled summary cards with icons, status indicators, and navigation links.",
  "frontend/src/pages/DonatePage.tsx": "Renders a donation page with preset donation levels, custom amount input, donor details, and impact descriptions. Handles donation submission through a query mutation with validation, success/error toasts, and scroll-based animations.",
  "frontend/src/pages/EventsPage.tsx": "Displays a list of events fetched from the backend with filtering for all, upcoming, or past events and sorting by date. Includes a hero section, filter controls, loading states, and event cards styled with Tailwind and UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery page with a hero section, category filters, and a grid of images filtered by category. Uses IntersectionObserver to animate elements on scroll and dialogs to view images in detail.",
  "frontend/src/pages/HomePage.tsx": "Implements the landing page with hero content, feature cards, stats, and impact imagery. Includes scroll- and mouse-based parallax effects and animated sections using IntersectionObserver.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays educational programs fetched from an API with category-based tabs and loading skeletons. Animates program cards on scroll and includes a hero section describing the programs.",
  "frontend/src/utils/authorizationErrors.ts": "Utility functions to normalize backend authentication/authorization errors into user-friendly messages and to detect whether an error is authorization-related.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, plugins, and an extended design system with custom colors, shadows, radii, animations, and container settings.",
  "project_state.json": "Machine-readable snapshot of the project’s architecture and feature set, describing the React + ICP backend system, admin/control panels, and a catalog of implemented features with versions."
}