{
  "backend/main.mo": "Motoko canister managing site settings with admin‑gated updates and link addition for header, footer, and social media.",
  "feature_evidence.json": "Feature evidence report linking a homepage hero-image update feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, hooks, styles, and config files.",
  "frontend/index.html": "Main ICP app HTML entry loading the React application via main.tsx with favicon.",
  "frontend/nonicp.html": "Static non‑ICP HTML entry loading the alternate React build via nonicp/main.jsx.",
  "frontend/public/data/events.v1.json": "Static JSON listing events with metadata like dates, locations, and publication timestamps.",
  "frontend/public/data/impact-stories.v1.json": "Static JSON dataset of published impact stories with titles, text, and optional images.",
  "frontend/public/data/programs.v1.json": "Static JSON program catalog including objectives, outcomes, categories, and optional images.",
  "frontend/public/data/team.v1.json": "Static JSON describing team members with roles, bios, visibility, and display order.",
  "frontend/src/App.tsx": "Main React app router and global error boundary defining all public, admin, and control panel routes.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin panel layout managing auth checks, admin access control, navigation, and logout handling.",
  "frontend/src/components/AuthModal.tsx": "Modal for login and signup handling form state, validation, and simulated auth actions.",
  "frontend/src/components/control/ControlLayout.tsx": "Admin control panel layout handling auth checks, sidebar navigation, and logout flow.",
  "frontend/src/components/control/StandaloneControlLayout.tsx": "Standalone variant of the control panel layout with similar auth checks and navigation, using direct URL redirects.",
  "frontend/src/components/Footer.tsx": "Footer displaying logo, navigation links, social links, and decorative styling elements.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, scroll effects, Internet Identity integration, and auth modal triggers.",
  "frontend/src/components/Layout.tsx": "App layout wrapper with error boundaries, safe rendering wrappers, header, footer, and routed content.",
  "frontend/src/constants/logo.js": "Exports canonical logo path and alt text for non-TS modules.",
  "frontend/src/constants/logo.ts": "Exports canonical logo path and alt text for TypeScript modules.",
  "frontend/src/ControlApp.tsx": "Standalone control‑panel React router configuring routes for dashboard, settings, and content management.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminAccess.ts": "Determines whether the authenticated user has admin privileges by querying their role from the actor.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides admin CRUD query and mutation hooks for programs and other backend-managed entities.",
  "frontend/src/hooks/useAdminRoleManagement.ts": "Provides mutations for admin role operations like registering emails and granting admin rights, invalidating related caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication lifecycle, exposing identity state, login, and logout functionality.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching programs, team members, stories, events, and other backend data via an actor.",
  "frontend/src/hooks/useSiteSettings.ts": "Defines React Query hooks and mutations for retrieving and updating site settings, including header, footer, and social links.",
  "frontend/src/index.css": "Configures Tailwind base styles and declares extensive light and dark theme CSS variables for UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and mounts the main App component.",
  "frontend/src/nonicp/App.jsx": "Sets up the non-ICP app’s router, pages, auth provider, theme provider, and query client configuration.",
  "frontend/src/nonicp/auth/AuthProvider.jsx": "Implements an authentication context that manages user sessions, registration, login, and logout via a local store.",
  "frontend/src/nonicp/auth/authStore.js": "LocalStorage-backed auth store providing user registration, sign-in, session persistence, and validation utilities.",
  "frontend/src/nonicp/auth/RequireAuth.jsx": "Guards protected routes by checking auth state and redirecting unauthenticated users to the login page.",
  "frontend/src/nonicp/auth/useAuth.js": "Exposes a hook to access authentication context values within the AuthProvider scope.",
  "frontend/src/nonicp/components/NonIcpFooter.jsx": "React footer component with quick links, social links, branding, and styled layout elements.",
  "frontend/src/nonicp/components/NonIcpHeader.jsx": "Responsive header with logo, navigation links, scroll-based styling, and mobile menu using Sheet.",
  "frontend/src/nonicp/components/NonIcpLayout.jsx": "Layout wrapper rendering header, footer, and routed page content via Outlet.",
  "frontend/src/nonicp/data/staticDataClient.js": "Client-side JSON fetcher with caching for programs, events, team members, and impact stories.",
  "frontend/src/nonicp/data/submissionsStore.js": "LocalStorage-backed storage for saving and retrieving donation and contact form submissions.",
  "frontend/src/nonicp/main.jsx": "Application entry point rendering the main App component into the root element.",
  "frontend/src/nonicp/pages/AboutPage.jsx": "About page that loads team members and impact stories, displaying mission, values, and animated sections.",
  "frontend/src/nonicp/pages/ContactPage.jsx": "Contact page with contact info, social links, and a form that saves submissions to localStorage.",
  "frontend/src/nonicp/pages/DonatePage.jsx": "Donation page with preset and custom amounts, impact areas, and a form that stores donation submissions.",
  "frontend/src/nonicp/pages/EventsPage.jsx": "Loads events from static data, applies filtering and sorting, and displays them with UI components and loading states.",
  "frontend/src/nonicp/pages/GalleryPage.jsx": "Renders a filterable image gallery with scroll-triggered animations and modal image viewing.",
  "frontend/src/nonicp/pages/HomePage.jsx": "Implements the homepage with animated hero, parallax effects, feature sections, and impact images.",
  "frontend/src/nonicp/pages/LoginPage.jsx": "Provides a login form with validation, error handling, and redirect logic using the app’s auth system.",
  "frontend/src/nonicp/pages/NotFoundPage.jsx": "Displays a styled 404 error page with a link back to the homepage.",
  "frontend/src/nonicp/pages/ProgramsPage.jsx": "Fetches and displays programs with category filtering, animations, and loading states using tab-based navigation.",
  "frontend/src/nonicp/pages/ProtectedPage.jsx": "Protected user page showing profile info, authentication features, and logout/home navigation.",
  "frontend/src/nonicp/pages/SignupPage.jsx": "Signup form with validation, error handling, and redirect logic for authenticated users.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying mission, values, impact stories, and team members with scroll animations.",
  "frontend/src/pages/admin/AdminContacts.tsx": "Admin interface for viewing, marking, and deleting contact form submissions with summaries and table-based management.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard displaying stats, contact messages, and a form to grant admin rights by email and principal ID.",
  "frontend/src/pages/admin/AdminDonations.tsx": "Page listing all donations with totals, averages, and a detailed table view.",
  "frontend/src/pages/admin/AdminEvents.tsx": "Admin interface to create, edit, delete, and filter events with image upload support.",
  "frontend/src/pages/admin/AdminImpactStories.tsx": "Page for managing impact stories including add, edit, delete, publish toggling, and image uploads.",
  "frontend/src/pages/admin/AdminLogin.tsx": "Admin login workflow handling Internet Identity login, email registration, association, and admin role granting.",
  "frontend/src/pages/admin/AdminPrograms.tsx": "Admin UI for listing, adding, editing, and deleting programs with image upload and form management.",
  "frontend/src/pages/admin/AdminTeam.tsx": "Admin interface to manage team members, including CRUD actions, visibility settings, and photo uploads.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with contact info, social links, and a validated message submission form.",
  "frontend/src/pages/control/ControlDashboard.tsx": "Dashboard showing summarized site statistics with cards linking to management sections.",
  "frontend/src/pages/control/ControlEvents.tsx": "Events management panel supporting search, filtering, and full CRUD with optional image uploads.",
  "frontend/src/pages/control/ControlGallery.tsx": "Gallery admin view handling image uploads with progress, item editing, ordering, and deletion.",
  "frontend/src/pages/control/ControlImpact.tsx": "Admin page for listing, searching, creating, editing, and deleting impact stories with image upload.",
  "frontend/src/pages/control/ControlPrograms.tsx": "Admin interface to manage programs, including CRUD operations, image uploads, and handling objectives and outcomes.",
  "frontend/src/pages/control/ControlSiteSettings.tsx": "Page for editing site-wide settings such as links, slogans, social media, and footer content.",
  "frontend/src/pages/control/ControlTeam.tsx": "Admin page to manage team members with fields for name, role, bio, order, visibility, and photo upload.",
  "frontend/src/pages/control/StandaloneControlDashboard.tsx": "Dashboard displaying admin statistics and navigation cards for managing site content.",
  "frontend/src/pages/DonatePage.tsx": "Donation page offering preset or custom amounts, impact descriptions, and a form to submit donations.",
  "frontend/src/pages/EventsPage.tsx": "Displays events fetched from the API with filtering by status and animated UI sections for browsing and loading states.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery of images with category filtering, scroll-triggered animations, and modal image previews.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero animations, parallax effects, feature highlights, statistics, and impact visuals.",
  "frontend/src/pages/ProgramsPage.tsx": "Lists educational programs with category tabs, animated sections, and loading skeletons while fetching program data.",
  "frontend/src/utils/authorizationErrors.ts": "Utility functions to normalize and detect authorization-related errors based on backend messages.",
  "frontend/STATIC_HOSTING.md": "Guide explaining ICP vs static hosting modes and their entry points and capabilities.",
  "frontend/tailwind.config.js": "TailwindCSS configuration enabling dark mode, custom colors, shadows, radii, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for replacing Home page hero images, including schema version, feature metadata, and pending request AR-1."
}