{
  "backend/main.mo": "Motoko canister managing site settings and admin-protected CRUD operations for header, footer, and social links.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components and pages.",
  "frontend/index.html": "Main ICP-enabled HTML entry loading React app via main.tsx.",
  "frontend/nonicp.html": "Static non-ICP entry loading alternate React bundle.",
  "frontend/public/data/events.v1.json": "Static dataset listing events with metadata, dates, and publication info.",
  "frontend/public/data/impact-stories.v1.json": "Static dataset of published impact stories with text and optional images.",
  "frontend/public/data/programs.v1.json": "Static dataset of program definitions with objectives, outcomes, and categories.",
  "frontend/public/data/team.v1.json": "Static dataset of team members with roles, bios, and visibility order.",
  "frontend/src/App.tsx": "Main React router and global error boundary configuring public, admin, and control routes.",
  "frontend/src/components/admin/AdminLayout.tsx": "Controls admin panel access with authentication and admin checks, rendering navigation and fallback states accordingly.",
  "frontend/src/components/AuthModal.tsx": "Provides a login/signup modal with form validation, loading states, and mode switching logic.",
  "frontend/src/components/control/ControlLayout.tsx": "Admin control panel layout that handles auth checks, redirects, access control, and renders navigation and content.",
  "frontend/src/components/control/StandaloneControlLayout.tsx": "Standalone control panel layout that verifies Internet Identity login, shows loading/auth prompts, and renders menu and routed content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer using backend site settings with fallbacks, including links, social icons, and branding.",
  "frontend/src/components/Header.tsx": "Displays the responsive site header with navigation, dynamic styling on scroll, and an authentication modal trigger.",
  "frontend/src/components/Layout.tsx": "Wraps the app in a layout with header, footer, suspense loading, and custom error boundaries for safe rendering.",
  "frontend/src/ControlApp.tsx": "Standalone control panel router defining routes for site settings and content management.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Determines whether the current authenticated user has admin privileges by querying their role from the backend.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides admin CRUD hooks for programs and other entities using the backend actor with automatic cache invalidation.",
  "frontend/src/hooks/useAdminRoleManagement.ts": "Exposes mutations for managing admin roles via email registration, association, and granting admin rights.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching programs, team members, impact stories, and events via an actor API with error handling and caching.",
  "frontend/src/hooks/useSiteSettings.ts": "Implements React Query hooks to fetch and mutate site settings, including header, footer, and social links with cache invalidation.",
  "frontend/src/index.css": "Defines global Tailwind styles and extensive CSS variables for light and dark themes using a luminous pastel palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/nonicp/App.jsx": "Sets up a non-ICP app with routing, authentication context, theming, and query client configuration.",
  "frontend/src/nonicp/auth/AuthProvider.jsx": "Provides authentication state and methods using a local storage–backed auth store.",
  "frontend/src/nonicp/auth/authStore.js": "Implements a localStorage-backed auth system for user registration, login, session restoration, and logout.",
  "frontend/src/nonicp/auth/RequireAuth.jsx": "Protects routes by checking authentication and redirecting unauthenticated users to login.",
  "frontend/src/nonicp/auth/useAuth.js": "Exports a hook that retrieves authentication context and enforces usage within AuthProvider.",
  "frontend/src/nonicp/components/NonIcpFooter.jsx": "A footer component displaying logo, description, social media icons, and navigation links.",
  "frontend/src/nonicp/components/NonIcpHeader.jsx": "A responsive header with dynamic scroll behavior, navigation links, authentication menu, and mobile drawer.",
  "frontend/src/nonicp/components/NonIcpLayout.jsx": "Layout wrapper that renders the header, footer, and routed page content.",
  "frontend/src/nonicp/data/staticDataClient.js": "Utility for fetching and caching static JSON data like programs, events, team members, and impact stories.",
  "frontend/src/nonicp/data/submissionsStore.js": "LocalStorage-based store for saving and retrieving donation and contact form submissions.",
  "frontend/src/nonicp/main.jsx": "Application entry point that mounts the React app with global styles.",
  "frontend/src/nonicp/pages/AboutPage.jsx": "Displays mission, values, team members, and impact stories with animated sections and fetched data.",
  "frontend/src/nonicp/pages/ContactPage.jsx": "Contact page with organization details, social links, and a form that saves submissions to localStorage.",
  "frontend/src/nonicp/pages/DonatePage.jsx": "Donation page offering preset or custom amounts and saving contributions to localStorage.",
  "frontend/src/nonicp/pages/EventsPage.jsx": "Loads events, filters and sorts them by status and date, and displays them with a gradient-styled layout and loading state.",
  "frontend/src/nonicp/pages/GalleryPage.jsx": "Displays a filterable gallery of images with scroll-triggered animations and modal image previews.",
  "frontend/src/nonicp/pages/HomePage.jsx": "Renders the homepage with feature sections, parallax hero and impact images, and scroll-based animations.",
  "frontend/src/nonicp/pages/LoginPage.jsx": "Provides a login form with validation, error handling, and redirect logic for authenticated users.",
  "frontend/src/nonicp/pages/NotFoundPage.jsx": "Simple 404 page offering a message and a button to return home.",
  "frontend/src/nonicp/pages/ProgramsPage.jsx": "Fetches and displays educational programs with category filtering, tabs, and scroll animations.",
  "frontend/src/nonicp/pages/ProtectedPage.jsx": "Protected page showing authenticated user profile details and options to sign out or navigate home.",
  "frontend/src/nonicp/pages/SignupPage.jsx": "Signup form handling validation, account creation, and redirecting authenticated users.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying mission, values, and dynamic impact stories and team data with scroll-triggered animations.",
  "frontend/src/pages/admin/AdminContacts.tsx": "Admin page for viewing, marking, and deleting contact form submissions with stats, tables, dialogs, and mutations.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard displaying stats, contact messages, and a form to grant admin rights by email and principal.",
  "frontend/src/pages/admin/AdminDonations.tsx": "Lists all donations and shows total count, total amount, and average donation with loading states.",
  "frontend/src/pages/admin/AdminEvents.tsx": "Admin interface to view, add, edit, filter, and delete events including image uploads and status management.",
  "frontend/src/pages/admin/AdminImpactStories.tsx": "Allows admins to create, edit, publish, and delete impact stories with optional images.",
  "frontend/src/pages/admin/AdminLogin.tsx": "Handles admin authentication via Internet Identity and email association, redirecting authorized admins to the dashboard.",
  "frontend/src/pages/admin/AdminPrograms.tsx": "Admin interface for listing, adding, editing, and deleting programs with image upload support.",
  "frontend/src/pages/admin/AdminTeam.tsx": "Admin page to manage team members, including creation, editing, ordering, visibility, and photo uploads.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with organization info, social links, and a form that submits messages via API with validation and animations.",
  "frontend/src/pages/control/ControlDashboard.tsx": "Dashboard displaying statistics for programs, events, gallery items, team members, and impact stories.",
  "frontend/src/pages/control/ControlEvents.tsx": "Control panel for managing events with add, edit, delete, filtering, image uploads, and status handling.",
  "frontend/src/pages/control/ControlGallery.tsx": "Admin gallery manager allowing item creation, editing, deletion, and image uploads with progress tracking.",
  "frontend/src/pages/control/ControlImpact.tsx": "Admin page for listing, creating, editing, deleting, and searching impact stories with image upload support.",
  "frontend/src/pages/control/ControlPrograms.tsx": "Admin interface to manage programs, including CRUD operations, image upload, and handling objectives and outcomes.",
  "frontend/src/pages/control/ControlSiteSettings.tsx": "Form-based admin page to edit site-wide settings such as links, slogans, and footer content.",
  "frontend/src/pages/control/ControlTeam.tsx": "Admin panel for adding, editing, and deleting team members, including photo upload and visibility settings.",
  "frontend/src/pages/control/StandaloneControlDashboard.tsx": "Standalone dashboard displaying key statistics and quick navigation cards for admin management.",
  "frontend/src/pages/DonatePage.tsx": "Donate page presenting preset donation levels and a form to submit custom donations using API and scroll animations.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and displays events with filtering and sorting, showing a hero section, filter controls, and a card list with loading states.",
  "frontend/src/pages/GalleryPage.tsx": "Loads gallery items, generates dynamic categories, filters images, and renders an animated gallery grid with a modal viewer.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with hero images, feature highlights, stats, and parallax/scroll-triggered animations.",
  "frontend/src/pages/ProgramsPage.tsx": "Fetches programs, builds dynamic categories, and displays them in tabbed sections with animations and loading skeletons.",
  "frontend/src/utils/authorizationErrors.ts": "Utility functions that normalize authorization-related error messages and detect auth errors.",
  "frontend/STATIC_HOSTING.md": "Guide explaining ICP vs static deployment modes and entry points.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, plugin usage, and extensive custom theme extensions for colors, spacing, shadows, and animations.",
  "project_state.json": "Project state metadata describing a website/admin panel and an in‑progress request to unify header and footer logos using an uploaded image."
}