{
  "backend/main.mo": "Motoko canister managing site settings, logos, and navigation links with admin‑restricted update and add‑link functions.",
  "feature_evidence.json": "Feature evidence report referencing Layout.tsx change to hide the header on /admin-panel/* routes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend components, pages, styles, and hooks.",
  "frontend/index.html": "Main ICP HTML entry loading the full React app with Internet Identity support.",
  "frontend/nonicp.html": "Static hosting entry point loading the non‑ICP React bundle.",
  "frontend/public/data/events.v1.json": "Static dataset defining upcoming and past events with metadata and timestamps.",
  "frontend/public/data/impact-stories.v1.json": "Static dataset of published impact stories with titles, text, and optional images.",
  "frontend/public/data/programs.v1.json": "Static dataset of educational programs including categories, objectives, outcomes, and metadata.",
  "frontend/public/data/team.v1.json": "Static dataset listing team members with roles, bios, visibility flags, and ordering.",
  "frontend/src/App.tsx": "Full application router and global error boundary defining all public, admin, and control panel routes.",
  "frontend/src/components/admin/AdminLayout.tsx": "Handles admin panel layout with authentication checks, role validation, navigation menu, and logout functionality.",
  "frontend/src/components/AuthModal.tsx": "Provides a login/signup modal with email and password validation, animated UI, and placeholder async auth handling.",
  "frontend/src/components/control/ControlLayout.tsx": "Admin layout that checks identity and admin access, redirects unauthorized users, and renders navigation and content slots.",
  "frontend/src/components/control/StandaloneControlLayout.tsx": "Standalone control panel layout that verifies Internet Identity, handles loading and logout, and provides mobile and sidebar navigation.",
  "frontend/src/components/Footer.tsx": "Renders a customizable footer with logo, about text, links, and social icons using backend settings with fallbacks.",
  "frontend/src/components/Header.tsx": "Displays a dynamic header with navigation, scrolling effects, auth modal triggers, and optional backend-driven links.",
  "frontend/src/components/Layout.tsx": "Wraps pages with header, footer, outlet, and error boundaries ensuring safe rendering and fallback UI.",
  "frontend/src/ControlApp.tsx": "Standalone router for the control panel version of the app with isolated layout and routes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Hook that determines whether the user is authenticated and has admin role by querying the backend through the actor.",
  "frontend/src/hooks/useAdminQueries.ts": "Collection of admin-focused React Query hooks for fetching and mutating programs and other entities via the backend actor.",
  "frontend/src/hooks/useAdminRoleManagement.ts": "Provides mutations for registering emails, associating principals, and granting admin roles using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity loading, status tracking, and logout.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching programs, team members, stories, events, and other data using an actor API with error handling and caching.",
  "frontend/src/hooks/useSiteSettings.ts": "Defines React Query hooks to get and mutate site settings, including header, footer, and social links, with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining light and dark theme CSS variables, typography rules, and base styling.",
  "frontend/src/main.tsx": "Initializes the app by creating the React root and wrapping it with query and identity providers.",
  "frontend/src/nonicp/App.jsx": "Sets up the non-ICP app version with routing, theming, authentication, and query client configuration.",
  "frontend/src/nonicp/auth/AuthProvider.jsx": "Implements a localStorage-backed authentication context handling signup, login, logout, and session restoration.",
  "frontend/src/nonicp/auth/authStore.js": "LocalStorage-based user and session management handling registration, login, session restore, and logout.",
  "frontend/src/nonicp/auth/RequireAuth.jsx": "A route guard component that redirects unauthenticated users to login while showing a loader during initialization.",
  "frontend/src/nonicp/auth/useAuth.js": "Hook that exposes authentication context values and functions.",
  "frontend/src/nonicp/components/NonIcpFooter.jsx": "React footer component showing logo, quick links, involvement links, and social icons.",
  "frontend/src/nonicp/components/NonIcpHeader.jsx": "Responsive header with navigation, scroll-based styling, and auth-aware user menu.",
  "frontend/src/nonicp/components/NonIcpLayout.jsx": "Layout wrapper rendering header, footer, and routed page content.",
  "frontend/src/nonicp/data/staticDataClient.js": "Client-side JSON fetcher with caching for programs, events, team, and stories data.",
  "frontend/src/nonicp/data/submissionsStore.js": "LocalStorage-backed store for saving and retrieving donations and contact submissions.",
  "frontend/src/nonicp/main.jsx": "React entry point rendering the App component.",
  "frontend/src/nonicp/pages/AboutPage.jsx": "About page displaying mission, values, team members, and impact stories with animations.",
  "frontend/src/nonicp/pages/ContactPage.jsx": "Contact page with contact info, social links, and a form saved to local storage.",
  "frontend/src/nonicp/pages/DonatePage.jsx": "Donation page with preset/custom amounts and form submission stored locally.",
  "frontend/src/nonicp/pages/EventsPage.jsx": "Fetches and filters events by status, displaying them with sorting, loading states, and UI controls.",
  "frontend/src/nonicp/pages/GalleryPage.jsx": "Displays a categorized image gallery with filters and scroll-triggered animations using an IntersectionObserver.",
  "frontend/src/nonicp/pages/HomePage.jsx": "Renders the homepage with hero sections, feature lists, parallax images, and scroll/mouse-driven animations.",
  "frontend/src/nonicp/pages/LoginPage.jsx": "Implements a login form with validation, error handling, and redirect logic using an authentication hook.",
  "frontend/src/nonicp/pages/NotFoundPage.jsx": "Shows a styled 404 page with messaging and a button linking back to the homepage.",
  "frontend/src/nonicp/pages/ProgramsPage.jsx": "Loads and displays educational programs with category filtering, tabs UI, and scroll-triggered animations.",
  "frontend/src/nonicp/pages/ProtectedPage.jsx": "Renders a protected user-only page showing profile info, logout option, and authentication feature list.",
  "frontend/src/nonicp/pages/SignupPage.jsx": "Implements a signup form with validation, error handling, and redirects after successful account creation.",
  "frontend/src/pages/AboutPage.tsx": "Displays the organization's mission, values, impact stories, and team members with animated sections.",
  "frontend/src/pages/admin/AdminContacts.tsx": "Admin panel for viewing, marking, and deleting contact form submissions with counts, tables, and confirmation dialogs.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing aggregated system stats, contact message counts, and a form to grant admin rights by email and principal.",
  "frontend/src/pages/admin/AdminDonations.tsx": "Displays donation statistics and a table of all donations with amounts, messages, and dates.",
  "frontend/src/pages/admin/AdminEvents.tsx": "Admin interface for listing, filtering, creating, editing, and deleting events with image upload support.",
  "frontend/src/pages/admin/AdminImpactStories.tsx": "Manages impact stories including listing, adding, editing, deleting, and toggling publication status with optional images.",
  "frontend/src/pages/admin/AdminLogin.tsx": "Handles admin authentication via Internet Identity and email association for admin access authorization.",
  "frontend/src/pages/admin/AdminPrograms.tsx": "Admin page for listing, creating, editing, and deleting programs with form handling and image upload.",
  "frontend/src/pages/admin/AdminTeam.tsx": "Admin interface to manage team members, including add, edit, delete, ordering, visibility, and photo upload.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact info, social links, and a validated contact form submitted through a query hook.",
  "frontend/src/pages/control/ControlDashboard.tsx": "Dashboard displaying counts of programs, events, gallery items, team members, and impact stats fetched from admin queries.",
  "frontend/src/pages/control/ControlEvents.tsx": "Control panel for managing events with search, filters, add/edit dialogs, deletion, and optional image upload.",
  "frontend/src/pages/control/ControlGallery.tsx": "Admin page for managing gallery items, supporting search, add/edit, delete, and image uploads with progress tracking.",
  "frontend/src/pages/control/ControlImpact.tsx": "Admin page for listing, searching, creating, editing, and deleting impact stories with optional image upload.",
  "frontend/src/pages/control/ControlPrograms.tsx": "Admin interface to add, edit, search, and remove programs, including category fields, objectives, outcomes, and image upload.",
  "frontend/src/pages/control/ControlSiteSettings.tsx": "Page for editing site-wide settings including header/footer links, social links, slogans, and newsletter text.",
  "frontend/src/pages/control/ControlTeam.tsx": "Admin page for managing team members with fields for name, role, bio, visibility, order, and optional photo upload.",
  "frontend/src/pages/control/StandaloneControlDashboard.tsx": "Dashboard displaying summary statistics for programs, events, team, and impact stories with a styled header and status badge.",
  "frontend/src/pages/DonatePage.tsx": "Offers preset and custom donation options, validates inputs, and submits donations with animated sections.",
  "frontend/src/pages/EventsPage.tsx": "Displays events fetched from the API with filtering (all, upcoming, past) and sorted listings, along with animated hero and loading states.",
  "frontend/src/pages/GalleryPage.tsx": "Shows gallery items with dynamic category filtering, scroll-triggered animations, and image modal previews.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero sections, feature highlights, stats, and parallax-animated images triggered on scroll.",
  "frontend/src/pages/ProgramsPage.tsx": "Fetches and displays programs with category tabs, scroll animations, and skeleton loaders for loading states.",
  "frontend/src/utils/authorizationErrors.ts": "Utility functions to normalize authorization-related error messages and detect auth errors based on message content.",
  "frontend/STATIC_HOSTING.md": "Guide explaining ICP vs static hosting modes and how each entry point loads the appropriate React app.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom content paths, extensive color/theme extensions, custom shadows, and animations. Imports typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's state, listing existing and new feature requests for logo replacement and conditional header visibility. Includes metadata like schema version and project details."
}