{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin panel routing + Internet Identity admin gating + grant admin by email UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix `/admin` redirect to point to the real admin dashboard route under `/admin-panel/dashboard` and remove any navigation to `/admin/dashboard`.",
      "acceptanceCriteria": [
        "If `sessionStorage.adminAuthenticated` is valid, visiting `/admin` redirects to `/admin-panel/dashboard`.",
        "No route attempts to navigate to `/admin/dashboard`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the `/admin` route redirect logic to navigate to `/admin-panel/dashboard` (and remove/replace any remaining references that navigate to `/admin/dashboard`)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Protect `/admin-panel/*` using Internet Identity authentication + backend admin role checks, and show clear UI states for unauthenticated and non-admin users while allowing authenticated admins to perform admin CRUD without authorization traps.",
      "acceptanceCriteria": [
        "A user who is not authenticated with Internet Identity cannot use `/admin-panel/*` to perform backend admin mutations; they are shown a clear English message and a path to authenticate.",
        "A user authenticated with Internet Identity but without admin role is blocked from `/admin-panel/*` actions with a clear English message (not a cryptic crash).",
        "A user authenticated with Internet Identity and having admin role can load `/admin-panel/dashboard` and successfully perform at least one admin CRUD action (e.g., create/update/delete a Program or Event) without backend authorization errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminAccess.ts",
          "operation": "create",
          "description": "Create a small hook that uses Internet Identity + the backend actor to determine admin access state (loading/authenticated/role), using role checks (`getCallerUserRole()` and/or `isCallerAdmin()`) to drive guards. Use the authorization component’s frontend guidance for role-based access and graceful handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminLayout.tsx",
          "operation": "modify",
          "description": "Replace the current sessionStorage/hardcoded admin gate with an Internet Identity + backend role-check guard. Show clear English states: (1) not authenticated → prompt to authenticate (include a login action), (2) authenticated but not admin → access denied message, (3) authenticated admin → render the admin navigation + outlet. Use the authorization component’s frontend guidance for AccessDenied UI and trap/error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove route-level sessionStorage-based protection for `/admin-panel/*` children and rely on the guarded `AdminLayout` to protect nested admin routes. Ensure no admin route renders protected content prior to passing the Internet Identity + admin role check."
        },
        {
          "path": "frontend/src/pages/admin/AdminLogin.tsx",
          "operation": "modify",
          "description": "Repurpose the `/admin` page into an Internet Identity-based admin entry screen (instead of hardcoded email/password + sessionStorage). When identity is present, check backend role and redirect admins to `/admin-panel/dashboard`; otherwise show a clear message and a path to authenticate. Use the authorization component’s frontend login/logout guidance and ensure cached query data is cleared on logout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminQueries.ts",
          "operation": "modify",
          "description": "Stop swallowing authorization failures as empty arrays/null for admin reads. Surface unauthorized errors in a controlled way (e.g., throwing a normalized error) so UI can display clear English messaging instead of silently failing or crashing. Also ensure admin mutations fail fast with readable errors when not admin. Use the authorization component’s frontend error-handling guidance for backend trap messages; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/authorizationErrors.ts",
          "operation": "create",
          "description": "Add a small utility to normalize backend authorization failures into user-friendly, consistent error messages (e.g., detect \"Unauthorized\" trap text), so admin pages and hooks can render clear English messages instead of cryptic errors. Use the authorization component’s frontend error-handling guidance; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add UI support to associate an email with the current Internet Identity principal and allow an existing admin to grant admin role to `nikhil44soni7@gmail.com` via backend-supported email association + admin-only grant flow.",
      "acceptanceCriteria": [
        "Backend supports saving/associating an email address to the caller’s principal.",
        "Backend exposes an admin-only function that assigns admin role to the principal associated with `nikhil44soni7@gmail.com`.",
        "From the UI, an existing admin can grant admin rights to `nikhil44soni7@gmail.com` and that user (after logging in with Internet Identity tied to that email association) is recognized as admin by `getCallerUserRole()`/`isCallerAdmin()`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminLogin.tsx",
          "operation": "modify",
          "description": "Add an email association section for the currently logged-in Internet Identity user to register/associate their email with their principal via backend calls. Include clear guidance that the email must be registered while logged in with the target Internet Identity principal (no third-party auth). Use the authorization component’s frontend guidance for authenticated flows; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add an admin-only \"Grant admin by email\" panel that allows an existing admin to grant admin rights to `nikhil44soni7@gmail.com` (and optionally other emails if already supported by backend interface). The UI should: (1) explain prerequisites (email must be registered/associated by that user while logged in), (2) call the backend grant function, and (3) show success/failure feedback with clear English messages. Use the authorization component’s frontend guidance for role-based access and graceful error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminRoleManagement.ts",
          "operation": "create",
          "description": "Create focused React Query mutations/queries for the email association + grant-admin flow (wrapping the backend functions exposed in the frontend backend interface), including cache invalidation and readable error propagation for unauthorized/invalid states. Use the authorization component’s frontend guidance for error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminLayout.tsx",
          "operation": "modify",
          "description": "Wire the admin-only role management UI visibility into the admin guard state (ensure only authenticated admins can see and use the grant-admin panel links/controls, while non-admin authenticated users receive a clear message). Use the authorization component’s frontend guidance; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}