{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 4,
  "summary": "Shunyatax Global Education Foundation is a React + Tailwind single-page website backed by an Internet Computer (DFINITY/ICP) Motoko canister. The public site presents the foundation’s mission, programs, events, gallery, donation flow, and contact form. A backend canister stores and serves content (programs, events, team members, impact stories), collects donations and contact submissions, and exposes admin-only statistics and management endpoints. Two management UIs exist: (1) an Admin Panel guarded by a simple sessionStorage email/password gate, and (2) a “Control Panel” protected by Internet Identity (II) which is intended to be deployable either integrated at /control or as a standalone app for an independent domain. Media (images) are handled as blobs via a storage mixin/ExternalBlob integration.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Public website shell with routed pages and resilient layout",
      "synonyms": [
        "SPA routing",
        "Site layout",
        "Header/Footer shell"
      ],
      "description": "Implements a public-facing React SPA with TanStack Router routes for Home, About, Programs, Events, Gallery, Donate, and Contact. Uses a Layout wrapper with safe Header/Footer/Outlet rendering and error boundaries with Suspense loading fallbacks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Animated, content-rich Home page with CTAs",
      "synonyms": [
        "Landing page",
        "Hero page"
      ],
      "description": "HomePage provides a hero section with animated gradients, parallax/scroll effects, featured images, statistics, impact imagery, feature cards, and calls-to-action linking to Programs, Donate, and Contact.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "About page with mission/vision/story/values and dynamic sections",
      "synonyms": [
        "About Us page"
      ],
      "description": "AboutPage renders mission/vision/story/impact/values content and optionally displays impact stories and team members fetched from the backend (with skeleton loading states) using scroll-triggered animations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Programs listing with category filtering and rich cards",
      "synonyms": [
        "Programs page",
        "Programs catalog"
      ],
      "description": "ProgramsPage fetches programs from the backend, builds category tabs, filters displayed programs, and renders cards with optional images, objectives, and expected outcomes. Includes skeleton loading and scroll animations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Events listing with upcoming/past filtering",
      "synonyms": [
        "Events page"
      ],
      "description": "EventsPage fetches events and allows filtering between all/upcoming/past based on event timestamps, then sorts by date and renders event cards with optional images and location/venue/date details.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Static gallery with category filters and lightbox dialogs",
      "synonyms": [
        "Gallery page",
        "Photo gallery"
      ],
      "description": "GalleryPage displays a static list of gallery images (assets) with category filtering, scroll animations, hover effects, and a dialog-based lightbox for enlarged viewing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Donation flow (public) with backend submission",
      "synonyms": [
        "Donate page",
        "Donations"
      ],
      "description": "DonatePage offers preset donation levels and a custom amount flow, validates donor inputs, and submits donations to the backend via React Query mutation (addDonation).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Contact page with backend form submission and contact info",
      "synonyms": [
        "Contact form",
        "Get in touch"
      ],
      "description": "ContactPage renders contact info cards, social links, and a validated contact form that submits to the backend (submitContactForm) with toast feedback and animated UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Public data-access hooks with caching and error handling",
      "synonyms": [
        "useQueries hooks",
        "React Query public API"
      ],
      "description": "useQueries provides typed React Query hooks for reading programs/team/impact stories/events (all/upcoming/past) and for submitting contact forms and donations. Includes retries, staleTime, and safe fallback returns.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Internet Identity authentication context",
      "synonyms": [
        "II auth",
        "DFINITY auth"
      ],
      "description": "InternetIdentityProvider wraps the app, manages AuthClient, loads persisted identity, supports login/logout, and exposes status flags and identity via useInternetIdentity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Backend actor initialization bound to identity",
      "synonyms": [
        "useActor",
        "Actor factory"
      ],
      "description": "useActor creates an anonymous actor when no identity is present and an authenticated actor when II identity exists. On authenticated creation it calls backend.initializeAccessControl() and invalidates/refetches dependent queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Motoko access control and role management",
      "synonyms": [
        "Authorization",
        "RBAC"
      ],
      "description": "Backend AccessControl module tracks roles per principal (admin/user/guest). First principal to initialize becomes admin; admins can assign roles; permission checks guard admin-only endpoints.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Backend content CRUD: Programs, Team, Impact Stories, Events",
      "synonyms": [
        "CMS storage",
        "Content management API"
      ],
      "description": "Motoko backend stores content in Maps and exposes add/update/delete and query methods for programs, team members (with visibility), impact stories (with published flag), and events (including upcoming/past/year queries).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Backend contact form submissions and admin moderation",
      "synonyms": [
        "Contact submissions API"
      ],
      "description": "Backend accepts contact form submissions from the public and provides admin-only endpoints to list submissions, mark them read/unread, and delete them.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Backend donation submission and admin reporting",
      "synonyms": [
        "Donations API"
      ],
      "description": "Backend accepts donations from the public and provides an admin-only endpoint to list all donations for reporting.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Backend dashboard statistics endpoint",
      "synonyms": [
        "Admin stats",
        "Metrics API"
      ],
      "description": "Backend exposes getDashboardStats() (admin-only) aggregating counts for programs, team, impact stories, contact forms, donations, total events, upcoming events, and past events.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Admin Panel (session-based) UI",
      "synonyms": [
        "/admin-panel",
        "Admin dashboard"
      ],
      "description": "Admin UI includes AdminLogin (sessionStorage-based gate), AdminLayout navigation, and admin pages for dashboard stats, CRUD for programs/events/team/impact stories, plus read-only donations and contact submission management (mark read/delete).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Control Panel (Internet Identity-protected) UI",
      "synonyms": [
        "/control",
        "II control panel"
      ],
      "description": "ControlLayout enforces Internet Identity presence and provides a management UI for programs, events, team, and impact stories with CRUD, plus a dashboard using backend stats. Control gallery management is currently a placeholder.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Standalone Control Panel app for independent deployment",
      "synonyms": [
        "ControlApp",
        "Independent domain control panel"
      ],
      "description": "A separate router tree and layouts (ControlApp.tsx, StandaloneControlLayout/Dashboard) support deploying the control panel on a separate domain while talking to the same backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Blob storage mixin and maintenance APIs",
      "synonyms": [
        "ExternalBlob support",
        "Caffeine storage integration"
      ],
      "description": "Backend includes blob-storage Mixin/Storage modules providing ExternalBlob type integration plus maintenance endpoints: updating authorized gateway principals, listing/pruning dead blobs with authorization, creating upload certificates (stub), and refilling a cashier canister with cycles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-the-broken-admin-login-redirect-so-that-when-an-already-authenticated-admin-visits-admin-the-app-redirects-to-the-actual-admin-dashboard-route-under-admin-panel-dashboard-not-admin-dashboard",
      "title": "Fix the broken admin login redirect so that when an already-authenticated admin visits `/admin`, the app redirects to the actual admin dashboard route under `/admin-panel/dashboard` (not `/admin/dashboard`).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-make-admin-panel-access-functional-with-the-backend-by-protecting-admin-panel-using-internet-identity-backend-admin-role-checks-instead-of-only-the-current-sessionstorage-hardcoded-credential-gate-so-authenticated-admins-can-actually-manage-programs-events-team-impact-donations-contacts-without-authorization-traps",
      "title": "Make admin panel access functional with the backend by protecting `/admin-panel/*` using Internet Identity + backend admin role checks (instead of only the current sessionStorage/hardcoded credential gate), so authenticated admins can actually manage programs/events/team/impact/donations/contacts without authorization traps.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-a-backend-supported-way-to-grant-admin-rights-to-the-email-nikhil44soni7-gmail-com-add-a-mechanism-to-associate-an-email-address-with-an-internet-identity-principal-and-add-an-admin-only-backend-method-to-assign-the-admin-role-by-email-once-that-email-has-been-registered-associated",
      "title": "Implement a backend-supported way to grant admin rights to the email `nikhil44soni7@gmail.com`: add a mechanism to associate an email address with an Internet Identity principal, and add an admin-only backend method to assign the `#admin` role by email once that email has been registered/associated.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement custom email/password authentication (signup/login) for public site, including login UI (header buttons / popup) and persistent user storage.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add admin user/role management: secure admin-panel login with email/password, ability for a super-admin to grant admin access to specific emails (e.g., nikhil44soni7@gmail.com) and manage users.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix /admin(/admin-panel) login access and implement a secure way to grant admin rights to a specific email (e.g., nikhil44soni7@gmail.com), aligning admin UI auth with backend role/principal authorization.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architecturalNotes": [
    "Frontend is a React SPA using @tanstack/react-router for routing and @tanstack/react-query for data fetching/caching.",
    "Global and layout-level error boundaries plus Suspense fallbacks are used to avoid blank screens and to provide recovery UI.",
    "UI is built with TailwindCSS (OKLCH token-based theme) and shadcn-style UI components; heavy use of animation utilities and IntersectionObserver-based scroll animations.",
    "Backend is a Motoko actor canister with in-memory Maps for each content type (programs, events, team, impact stories, donations, contact forms) and query/shared methods for CRUD.",
    "Backend authorization uses a custom AccessControl module (roles: admin/user/guest) where the first non-anonymous principal to initialize becomes admin; subsequent principals become users unless reassigned by an admin.",
    "Frontend actor creation (useActor) is identity-aware: anonymous actor for public access; authenticated actor for II users; calls initializeAccessControl() when identity is present.",
    "Admin/data operations are encapsulated in custom hook factories (useQueries for public and useAdminQueries for admin/control) which wrap actor calls, handle retries, and invalidate React Query caches.",
    "A blob-storage mixin is included in the backend to support ExternalBlob assets and maintenance operations (gateway principal authorization, dead-blob pruning, cashier refill).",
    "Two management entrypoints exist: integrated control routes under /control in App.tsx, and a separate ControlApp.tsx for standalone control panel deployment with its own router tree.",
    "User request: fix admin panel login access and provide a mechanism to grant admin rights to a specific email; implies aligning admin-panel authentication with backend authorization (currently Internet Identity principal-based)."
  ],
  "knownIssues": [
    "Admin Panel authentication is front-end only with hard-coded credentials (email/password) and sessionStorage; it does not authenticate to the canister. Backend mutations require #admin via Internet Identity-based principal roles, so the Admin Panel may be non-functional unless the operator is also authenticated via II and is an assigned admin principal.",
    "In App.tsx, the /admin route auto-redirect when already authenticated points to \"/admin/dashboard\" but the configured admin routes live under \"/admin-panel/*\" (likely a broken redirect).",
    "Backend getAllImpactStories() filters to published stories only; the admin/control UIs call this same method expecting all stories, making it impossible to manage drafts via the current API.",
    "Backend getAllTeamMembers() filters to visible members only; admin/control UIs call this expecting full access, so hidden members may be impossible to review/edit through the current API.",
    "ControlEvents UI allows creating/editing events without a description, but useAdminQueries enforces description as required for add/update, causing likely runtime errors for empty descriptions.",
    "Data persistence is not upgrade-safe: backend Maps are not stored in stable variables and there are no preupgrade/postupgrade hooks, so content will be lost on canister upgrade/reinstall.",
    "IDs are derived from mutable fields (e.g., program id = title + \"_\" + category; team id = name + \"_\" + role). This can cause collisions/overwrites and makes renaming tricky (id does not change on update).",
    "Event date handling mixes date-only inputs (ControlEvents) and datetime-local inputs (AdminEvents) and converts via JS Date (timezone-sensitive), which may lead to inconsistent stored timestamps.",
    "Gallery management is not implemented: public gallery is static assets; control gallery page is a placeholder.",
    "AuthModal for user login/signup is a UI-only stub (TODO: backend integration); it does not create users or authenticate against the canister.",
    "Admin panel email/password login is currently failing for the requested account (nikhil44soni7@gmail.com / nikhil44soni7), preventing access to manage events/gallery/content.",
    "Admin panel login/access control remains problematic: user reports inability to log in and requests admin access for a specific email; indicates current /admin(/admin-panel) auth flow is not reliably granting functional admin access against backend role checks."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Shunyatax Global Education Foundation",
  "clarification_mode": "instant",
  "clarification_rounds": 0,
  "requiresBackendChanges": true,
  "requiresFrontendChanges": true
}